{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "microsoft/Phi-3-mini-4k-instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.23.mlp.gate_up_proj",
    "model.layers.20.self_attn.o_proj",
    "model.layers.16.mlp.gate_up_proj",
    "model.layers.23.mlp.down_proj",
    "model.layers.18.mlp.down_proj",
    "model.layers.16.mlp.down_proj",
    "model.layers.22.self_attn.qkv_proj",
    "model.layers.20.self_attn.qkv_proj",
    "model.layers.18.mlp.gate_up_proj",
    "model.layers.22.self_attn.o_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}