{
  "auto_mapping": null,
  "base_model_name_or_path": "microsoft/Phi-3-mini-4k-instruct",
  "fan_in_fan_out": false,
  "feedforward_modules": [
    "model.layers.23.mlp.down_proj",
    "model.layers.18.mlp.down_proj",
    "model.layers.16.mlp.down_proj"
  ],
  "inference_mode": true,
  "init_ia3_weights": true,
  "modules_to_save": null,
  "peft_type": "IA3",
  "revision": null,
  "target_modules": [
    "model.layers.16.mlp.down_proj",
    "model.layers.22.self_attn.qkv_proj",
    "model.layers.16.mlp.gate_up_proj",
    "model.layers.18.mlp.gate_up_proj",
    "model.layers.23.mlp.down_proj",
    "model.layers.22.self_attn.o_proj",
    "model.layers.23.mlp.gate_up_proj",
    "model.layers.20.self_attn.qkv_proj",
    "model.layers.20.self_attn.o_proj",
    "model.layers.18.mlp.down_proj"
  ],
  "task_type": "CAUSAL_LM"
}